// 民族
var mz_arr = [
"--空--",
"汉族",
"满族",
"侗族",
"瑶族",
"白族",
"土家族",
"哈尼族",
"哈萨克族",
"傣族",
"黎族",
"傈僳族",
"佤族",
"畲族",
"高山族",
"拉祜族",
"水族",
"东乡族",
"纳西族",
"景颇族",
"柯尔克孜族",
"土族",
"达斡尔族",
"仫佬族",
"羌族",
"布朗族",
"撒拉族",
"毛难族",
"仡佬族",
"锡伯族",
"阿昌族",
"普米族",
"塔吉克族",
"怒族",
"乌孜别克族",
"俄罗斯族",
"鄂温克族",
"崩龙族",
"保安族",
"裕固族",
"京族",
"塔塔尔族",
"独龙族",
"鄂伦春族",
"赫哲族",
"门巴族",
"珞巴族",
"基诺族",
"蒙古族",
"回族",
"藏族",
"维吾尔族",
"苗族",
"彝族",
"壮族",
"布依族",
"朝鲜族",
"其他",
"外国血统"
]

//政治面貌
var zzmm_arr=[
"--空--",
"中国共产党党员",
"中国共产党预备党员",
"中国共产主义青年团团员",
"中国国民党革命委员会会员",
"中国民主同盟盟员",
"中国民主建国会会员",
"中国民主促进会会员",
"中国农工民主党党员",
"中国致公党党员",
"九三学社社员",
"台湾民主自治同盟盟员",
"无党派民主人士",
"群众"]

//文化程度
var whcd_arr = [
"--空--",
"博士",
"研究生",
"本科",
"专科",
"中专",
"职高",
"高中",
"初中",
"小学",
"半文盲",
"文盲"
]


//婚姻状况
var hyzk_arr = [
"--空--",
"未知",
"未婚",
"已婚",
"离异"
]

//档案类型
var dalx_arr = [
"未知",
"未婚",
"已婚",
"离异"
]

//档案类型 数值
var dalx_val_arr = [
"未知",
"未婚",
"已婚",
"离异"
]



function fill_select( id ,show_arr ,value_arr ){
    var option_data = "";
    
    if (value_arr){
        for(var i= 0 ; i<show_arr.length ; i++)
        {
            option_data+= "<option value='" + value_arr[i] + "'>" +show_arr[i] + "</option>"
        } 
    }else{
        for(var i= 0 ; i<show_arr.length ; i++)
        {
            option_data+= "<option value='" + show_arr[i] + "'>" + show_arr[i] + "</option>"
        }  
    }
    
    //清空
    $("#"+id+" option").remove();
   
    $("#"+id).append(option_data);
}